#include <stdio.h>

void task1();
void task2();
void task3();
int main() {
    task1();
    task2();
    task3();
    return 0;
}
void task1(){
    printf("123\n"); // подзадание 1
    printf("1\n2\n3\n"); // подзадание 2
    printf("1\n\t2\n\t\t3\n"); // подзадание 3
    printf("%1d\n%2d\n%3d\n%4d\n",1,2,3,4); // подзадание 4
    printf("%10.3f\n",12.234657); // подзадание 5
    printf("%10.5f\n",12.234657); // подзадание 6
    printf ("Остаток от деления %d на %d равен %d\n ",5, 2, 5%2); // подзадание 7
    printf ("Деление %d на %d равно %d\n ",7, 5, 7/5); // подзадание 8
    printf ("Умножение %d на %d равно %d\n ",2000, 4, 2000*4); // подзадание 9
    printf ("%g разделить %e равно %f\n ",5., 2000000., 5./2000000); // подзадание 10.1
    printf ("%d разделить %d равно %d\n ",5., 2000000., 5./2000000); // подзадание 10.2
    printf ("%f разделить %f равно %f\n ",5., 2000000., 5./2000000); // подзадание 10.3
    printf ("%g разделить %g равно %g\n ",5., 2000000., 5./2000000); // подзадание 10.4
    printf ("%e разделить %e равно %e\n ",5., 2000000., 5./2000000); // подзадание 10.5
}
void task2(){
    int N,K;
    N=18;
    K=33;
    printf("Сейчас %d часов %d минут 00 секунд\n",N,K);
    printf("Идет %d минута суток\n",1440-N*60-K);
    printf("До полуночи осталось %d часов и %d минут\n",24-N, 60-K);
    printf("С 8.00 прошло %d секунд\n",(N-8)*3600+K*60);
    printf("Текущий час = %.2f суток и текущая минута = %.2f часа \n", (float)N/24, (float)K/60);
}
void task3(){
    int L, n, k, m;
    L=313;
    n=3;
    k=4;
    m=2;
    printf("данные: %d %d\nрезультат: %-+*.*f",n,L,(k+m+2),m, (float)n/L);

}